Revit 2027 API
SchemaBuilder Constructor
 Constructs a new SchemaBuilder where the resulting Schema will use the input GUID.
Namespace: Autodesk.Revit.DB.ExtensibleStorage
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public SchemaBuilder(
	Guid guid
)
Public Sub New (
	guid As Guid
)
public:
SchemaBuilder(
	Guid guid
)
new :
        guid : Guid -> SchemaBuilder
Parameters
guid Guid
Exceptions
Exception | Condition
ArgumentException |  The guid value is invalid.
See Also
Reference
SchemaBuilder Class
Autodesk.Revit.DB.ExtensibleStorage Namespace